# IsAcceptableToPosition Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementFromToCalculationPoints..::..IsAcceptableToPosition Method
SpatialElementFromToCalculationPoints Class See Also
---
Checks whether a given "to" position is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsAcceptableToPosition(
	XYZ toPosition
)
```

Visual Basic
---
```text
Public Function IsAcceptableToPosition ( _
	toPosition As XYZ _
) As Boolean
```

Visual C++
---
```text
public:
bool IsAcceptableToPosition(
	XYZ^ toPosition
)
```

# ### Parameters
toPosition
    Type: Autodesk.Revit.DB..::..XYZ
# ### Return Value
True if the input is an acceptable "to" position and False otherwise.
# Remarks
The "from" position and the "to" position must be on opposite sides of the family's host. Flipping the calculation point will reverse the direction.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SpatialElementFromToCalculationPoints Class
Autodesk.Revit.DB Namespace